Repository: huyquang-bka/smart_gate_new_version
Catalog: lib/l10n/app_*.arb
Languages: vi

source: Login
vi: Đăng nhập

source: Username
vi: Tên đăng nhập

source: Password
vi: Mật khẩu

# enterUsername
source: Enter your username
vi: Nhập tên đăng nhập

# enterPassword
source: Enter your password
vi: Nhập mật khẩu

source: Remember me
vi: Ghi nhớ đăng nhập

source: Contact admin
vi: Liên hệ admin

# noAccount
source: Don't have an account yet?
vi: Chưa có tài khoản?

source: Account
vi: Tài khoản

source: Full Name
vi: Họ và tên

# userId
source: User ID: {id}
vi: ID người dùng: {id}

# companyId
source: Company ID: {id}
vi: ID đơn vị: {id}

source: Logout
vi: Đăng xuất

# logoutConfirm
source: Are you sure you want to logout?
vi: Bạn có chắc chắn muốn đăng xuất?

source: Cancel
vi: Hủy

# copyright
source: Â© 2024 ATIN. All rights reserved.
vi: © 2024 ATIN. Bảo lưu mọi quyền.

source: Seal Scanner
vi: Mã chì

# checkpointInfo
source: Checkpoint Information
vi: Thông tin làn

source: Select Checkpoint
vi: Chọn làn

# code
source: Code: {code}
vi: Mã: {code}

# lane
source: Lane: {lane}
vi: Làn: {lane}

# sealNumber
source: Seal Number {index}
vi: Số seal {index}

source: Dangerous
vi: Nguy hiểm

source: Take Photo
vi: Chụp ảnh

source: Choose from Gallery
vi: Chọn từ thư viện

source: Delete Photo
vi: Xóa ảnh

source: Send
vi: Gửi

# sending
source: Sending data...
vi: Đang gửi dữ liệu...

source: Success
vi: Thành công

source: Error
vi: Lỗi

# dataSent
source: Data sent successfully
vi: Gửi dữ liệu thành công

# sendFailed
source: Failed to send data: {error}
vi: Lỗi gửi dữ liệu: {error}

source: Loading profile...
vi: Đang tải thông tin...

source: Error loading profile
vi: Lỗi tải thông tin

# loginFailed
source: Invalid username or password
vi: Tên đăng nhập hoặc mật khẩu không đúng

source: Network error
vi: Lỗi mạng

source: Loading...
vi: Đang tải...

# emailLaunchError
source: Could not launch email
vi: Không thể mở email

# requestAccess
source: Request for Account Access - {appName}
vi: Yêu cầu cấp quyền truy cập - {appName}

source: Dashboard
vi: Trang chủ

# currentVersion
source: Current Version: {version}
vi: Phiên bản hiện tại: {version}

source: Invalid Checkpoint
vi: Làn không hợp lệ

# selectValidCheckpoint
source: Please select a valid checkpoint before sending data
vi: Vui lòng chọn làn hợp lệ trước khi gửi dữ liệu

source: Incomplete Data
vi: Dữ liệu không đầy đủ

# fillSealData
source: Please fill in at least Seal 1 for Container 1
vi: Vui lòng điền ít nhất Seal 1 cho Container 1

source: Sending data...
vi: Đang gửi dữ liệu...

# dataSentSuccess
source: Data sent successfully
vi: Gửi dữ liệu thành công

# dataSentError
source: Error sending data: {error}
vi: Lỗi gửi dữ liệu: {error}

# errorLoadingCheckpoints
source: Error loading checkpoints: {error}
vi: Lỗi tải danh sách làn: {error}

source: Unknown
vi: Không xác định

# unknownCode
source: UNKNOWN
vi: KHÔNG XÁC ĐỊNH

# checkpointCode
source: Code: {code}
vi: Mã: {code}

# checkpointLane
source: Lane: {lane}
vi: Điểm giám sát: {lane}

source: Warning
vi: Cảnh báo

source: MQTT Connected
vi: Đã kết nối MQTT

# mqttConnectionError
source: Error connecting to MQTT: {error}
vi: Lỗi kết nối MQTT: {error}

# readyToSend
source: Ready to send data
vi: Sẵn sàng gửi dữ liệu

# sendingMqtt
source: Sending MQTT message
vi: Đang gửi tin nhắn MQTT

# noCheckpoint
source: No checkpoint selected
vi: Chưa chọn làn

# invalidSeal
source: Invalid seal data
vi: Dữ liệu số seal không hợp lệ

# sealRequired
source: At least one seal is required
vi: Cần ít nhất một số seal

# checkpointRequired
source: Please select a checkpoint first
vi: Vui lòng chọn làn trước

# seal1
source: Seal Number 1
vi: Số seal 1

# seal2
source: Seal Number 2
vi: Số seal 2

source: Preview Photo
vi: Xem trước ảnh

source: Close Preview
vi: Đóng

source: Recognizing text...
vi: Đang nhận dạng chữ...

# recognitionFailed
source: Failed to recognize text
vi: Không thể nhận dạng chữ

# recognitionError
source: Error during text recognition: {error}
vi: Lỗi nhận dạng chữ: {error}

# pickImageError
source: Error picking image: {error}
vi: Lỗi chọn ảnh: {error}

# companyIdTitle
source: Company ID
vi: Mã đơn vị

# errorLoadingAuth
source: Error loading profile data
vi: Lỗi tải thông tin tài khoản

# connectError
source: Connection error. Please check your connection
vi: Lỗi kết nối. Vui lòng kiểm tra kết nối mạng

source: Server error
vi: Lỗi server

# unknownError
source: Unknown error occurred
vi: Đã xảy ra lỗi không xác định

# timeoutError
source: Connection timeout
vi: Thời gian kết nối hết hạn

source: Edit Container 1
vi: Sửa Container 1

source: Edit Container 2
vi: Sửa Container 2

source: Container Code
vi: Mã Container

source: Container Information
vi: Thông tin Container

# containerTimeLabel
source: Time
vi: Thời gian

# containerCheckpointLabel
source: Checkpoint
vi: Làn

source: Additional Information
vi: Thông tin bổ sung

# maxImages
source: {current}/{max} Images
vi: {current}/{max} Ảnh

source: Add Photo
vi: Thêm ảnh

source: View Photo
vi: Xem ảnh

source: Description
vi: Mô tả

source: Tasks
vi: Danh sách nhiệm vụ

# noTasks
source: No tasks available
vi: Không có nhiệm vụ

# timeLabel
source: Time
vi: Thời gian

# checkpointLabel
source: Checkpoint
vi: Làn

source: Remove
vi: Xóa

source: Unknown Checkpoint
vi: Làn không xác định

# checkpointWithLane
source: {name} - Lane {lane}
vi: {name} - Làn {lane}

source: Checkpoint: {id}
vi: Làn: {id}

# time
source: Time: {time}
vi: Thời gian: {time}

# cargoTypeLabel
source: Cargo Type
vi: Loại hàng

# cargoType
source: {code, select, AK{Over Dimension} BB{Break Bulk} BN{Bundle} DG{Dangerous} DR{Reefer & DG} ED{Dangerous Empty} FR{Fragile} GP{General} MT{Empty} RF{Reefer} DO{DG & Over Dimension} other{Unknown}}
vi: {code, select, AK{Quá khổ} BB{Hàng rời} BN{Gói hàng} DG{Nguy hiểm} DR{Lạnh & Nguy hiểm} ED{Nguy hiểm (rỗng)} FR{Dễ vỡ} GP{Thông dụng} MT{Rỗng} RF{Lạnh} DO{Nguy hiểm & Quá khổ} other{Không xác định}}
